#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.dev-portal.data.konnect_portal_list.my_portallist: Reading...
module.control-planes.konnect_gateway_control_plane.cps["home_cluster"]: Refreshing state... [id=99461c4a-eda0-4025-97e9-bd039d3ecf2f]
module.dev-portal.konnect_application_auth_strategy.keyauth: Refreshing state... [id=f27fb1d2-4776-436b-ab2d-d31471dcca81]
module.control-planes.konnect_mesh_control_plane.tf_global_cp: Refreshing state... [id=0616e60c-3d2a-458a-8da5-0cecbcb05d52]
module.dev-portal.konnect_application_auth_strategy.oidc: Refreshing state... [id=a23a6caa-c9f5-4db2-8b69-3df201349af9]
module.control-planes.konnect_gateway_control_plane.cps["dev"]: Refreshing state... [id=0df2812e-4b71-49c1-83ca-7c9e8f0e9c43]
module.gateway-configs.konnect_gateway_consumer.alex: Refreshing state... [id=c00f8ddf-782d-4df9-befc-6b83fe1036e4]
module.gateway-configs.konnect_gateway_consumer.alice: Refreshing state... [id=c4af45b4-c592-48a0-91dc-62341102b66d]
module.gateway-configs.konnect_gateway_route.catch_all: Refreshing state... [id=5da78168-60ce-4a98-8e8d-d8c76a0c0e92]
module.gateway-configs.konnect_gateway_service.httpbin: Refreshing state... [id=5c67f486-0025-40c4-ba26-e50715a47c43]
module.gateway-configs.konnect_gateway_service.echo: Refreshing state... [id=0cab2efc-c7d0-4313-99a1-eab303aa4022]
module.dev-portal.data.konnect_portal_list.my_portallist: Read complete after 2s
module.dev-portal.konnect_api_product.httpbin: Refreshing state... [id=65a4d875-01a4-4740-a235-e67d5b1502f6]
module.dev-portal.konnect_api_product.echo: Refreshing state... [id=47779605-3533-47d9-a35d-51860b10fa6a]
module.dev-portal.konnect_portal.my_portal: Refreshing state... [id=22723cee-27f7-490b-9f01-3bd312b2bafb]
module.gateway-configs.konnect_gateway_route.echo: Refreshing state... [id=7cb81d2e-cc29-4ac2-b81f-5ff1fcb49c5b]
module.gateway-configs.konnect_gateway_plugin_key_auth.key_auth: Refreshing state... [id=343d10e1-c1ad-4b18-a5cc-a2bbb38a863c]
module.dev-portal.konnect_api_product_version.echo_v1: Refreshing state... [id=094d9a39-4259-4bb4-9df0-5c018e8ef3ac]
module.gateway-configs.konnect_gateway_basic_auth.alex_basicauth: Refreshing state... [id=7c6d0208-38d9-46b0-b828-93025593d27c]
module.gateway-configs.konnect_gateway_key_auth.alex_keyauth: Refreshing state... [id=1b1ce517-1a3a-44f9-9b3a-4ba923890c0f]
module.gateway-configs.konnect_gateway_plugin_basic_auth.basic_auth: Refreshing state... [id=0fa3f7cc-1bca-40da-ac30-29de0fd6bab3]
module.gateway-configs.konnect_gateway_route.httpbin: Refreshing state... [id=fefa8265-12f3-476e-8834-c2ddf3bee646]
module.dev-portal.konnect_api_product_version.httpbin_v1: Refreshing state... [id=f397cd99-0a4c-43f4-993d-133295b84039]
module.gateway-configs.konnect_gateway_key_auth.alice_keyauth: Refreshing state... [id=a43139bf-1053-4aa2-89cf-a741dce6a803]
module.gateway-configs.konnect_gateway_basic_auth.alice_basicauth: Refreshing state... [id=c0078009-10e1-44a6-80a6-6476d402ec30]
module.gateway-configs.konnect_gateway_plugin_request_termination.catch_all_terminate: Refreshing state... [id=86b3a813-ae39-4671-a762-b05e582a0c5c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.control-planes.konnect_gateway_control_plane.cps["staging"] will be created
  + resource "konnect_gateway_control_plane" "cps" {
      + auth_type    = "pki_client_certs"
      + cluster_type = "CLUSTER_TYPE_CONTROL_PLANE"
      + config       = (known after apply)
      + description  = "This is the first control plane created by terraform"
      + id           = (known after apply)
      + labels       = {
          + "Name"        = "staging"
          + "provisioner" = "terraform"
        }
      + name         = "staging"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ gateway_cps_endpoints = [
        {
            dev = {
                control_plane_endpoint = "https://b68d713400.au.cp0.konghq.com"
                telemetry_endpoint     = "https://b68d713400.au.tp0.konghq.com"
            }
        },
      + {
          + staging = (known after apply)
        },
        {
            home_cluster = {
                control_plane_endpoint = "https://aae3f7c47f.au.cp0.konghq.com"
                telemetry_endpoint     = "https://aae3f7c47f.au.tp0.konghq.com"
            }
        },
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @liyangau, Action: `pull_request`*